BOQ/src/InformationRegisters/ПраваНаИзменениеДокументов/ПраваНаИзменениеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПраваНаИзменениеДокументов</name>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.ДействияРазрешитьЗапретить</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>РольПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МетодРасчетаОграничения</name>
    <type>
      <types>EnumRef.МетодРасчетаОграниченийДоступаКДокументам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BOQ/src/Enums/МетодРасчетаОграниченийДоступаКДокументам/МетодРасчетаОграниченийДоступаКДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодРасчетаОграниченийДоступаКДокументам</name>
  <enumValues>
    <name>Период</name>
  </enumValues>
  <enumValues>
    <name>КоличествоДней</name>
  </enumValues>
</mdclass:Enum>

BOQ/src/Enums/ДействияРазрешитьЗапретить/ДействияРазрешитьЗапретить.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияРазрешитьЗапретить</name>
  <enumValues>
    <name>Разрешить</name>
  </enumValues>
  <enumValues>
    <name>Запретить</name>
  </enumValues>
</mdclass:Enum>

BOQ/src/InformationRegisters/ПраваНаИзменениеДокументов/Forms/Запись/Module.bsl
&НаКлиенте 
Перем СписокДокументов;

&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	ТолькоПросмотр = получитьДоступность ();
	Если ( ТолькоПросмотр ) Тогда
		Возврат;
	КонецЕсли;
	Если ( НЕ ЗначениеЗаполнено ( Параметры.Ключ ) ) Тогда
		Запись.МетодРасчетаОграничения = Перечисления.МетодРасчетаОграниченийДоступаКДокументам.Период;
		Запись.Действие = Перечисления.ДействияРазрешитьЗапретить.Разрешить;
		Запись.ДатаНачала = ТекущаяДата ();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере 
Функция получитьДоступность ()
	
	Возврат НЕ ( РольДоступна ( "ПолныеПрава" ) ); 

КонецФункции

&НаКлиенте
Процедура ТипДокументаНачалоВыбора ( Элемент, ДанныеВыбора, СтандартнаяОбработка )
	
	ПоказатьВыборИзСписка ( Новый ОписаниеОповещения ( "ОбработатьВыборИзСписка", ЭтотОбъект ), СписокДокументов, Элемент );
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборИзСписка ( Результат, ДополнительныеПараметры ) Экспорт 
	
	Если ( Результат <> Неопределено ) Тогда
		ТипДокумента = Результат.Представление;
		Запись.ТипДокумента = Результат.Значение;
	КонецЕсли; 
	                                              
КонецПроцедуры 

&НаСервереБезКонтекста
Функция получитьСписокДокументов ()
	
	список = Новый СписокЗначений;
	Для Каждого докМетадата Из Метаданные.Документы Цикл
		список.Добавить ( докМетадата.Имя, докМетадата.Синоним );		
	КонецЦикла;
	Возврат список;
	
КонецФункции 

&НаКлиенте
Процедура МетодРасчетаОграниченияПриИзменении ( Элемент )
	
	ОбновитьЭлементыФормы ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	СписокДокументов = получитьСписокДокументов ();
	ОбновитьЭлементыФормы ();
	Если ( Запись.ТипДокумента <> "" ) Тогда
		ТипДокумента = СписокДокументов.НайтиПоЗначению ( Запись.ТипДокумента ).Представление; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы ()
	
	методПериод = ( Запись.МетодРасчетаОграничения = ПредопределенноеЗначение ( "Перечисление.МетодРасчетаОграниченийДоступаКДокументам.Период" ) );
	Элементы.ДатаНачала.Видимость = методПериод;
	Элементы.ДатаОкончания.Видимость = методПериод;
	элементы.КоличествоДней.Видимость = НЕ методПериод;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТипДокументаОчистка ( Элемент, СтандартнаяОбработка )
	
	Запись.ТипДокумента = "";
	
КонецПроцедуры
